In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [25]:
#read the dataframe
df = pd.read_csv("Churn_Modelling_Modified.csv")
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           9946 non-null   object
 6   Age              9700 non-null   float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

In [27]:
#another way to check the null values
df.isnull().sum()

RowNumber            0
CustomerId           0
Surname              0
CreditScore          0
Geography            0
Gender              54
Age                300
Tenure               0
Balance              0
NumOfProducts        0
HasCrCard            0
IsActiveMember       0
EstimatedSalary      0
Exited               0
dtype: int64

# Handling the null values

## deleting the columsn with missing data

In [28]:
update_df = df.dropna(axis=1)
update_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Tenure           10000 non-null  int64
 6   Balance          10000 non-null  float64
 7   NumOfProducts    10000 non-null  int64
 8   HasCrCard        10000 non-null  int64
 9   IsActiveMember   10000 non-null  int64
 10  EstimatedSalary  10000 non-null  float64
 11  Exited           10000 non-null  int64
dtypes: float64(2), int64(8), object(2)
memory usage: 937.6+ KB

## for the above case we have droped the collums with the null values -> we may loose important features

In [29]:
update_df_1 = df.dropna(axis=0) # axis = 0 means droping only the rows

In [30]:
update_df_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9648 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        9648 non-null   int64
 1   CustomerId       9648 non-null   int64
 2   Surname          9648 non-null   object
 3   CreditScore      9648 non-null   int64
 4   Geography        9648 non-null   object
 5   Gender           9648 non-null   object
 6   Age              9648 non-null   float64
 7   Tenure           9648 non-null   int64
 8   Balance          9648 non-null   float64
 9   NumOfProducts    9648 non-null   int64
 10  HasCrCard        9648 non-null   int64
 11  IsActiveMember   9648 non-null   int64
 12  EstimatedSalary  9648 non-null   float64
 13  Exited           9648 non-null   int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

In [31]:
update_df_1.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

## we drop the data row which has only the nan values-> more better as we have less data loss

## another way is to fill the nan values

In [32]:
# to caluculate the mean of the age collumsn
print(f"teh mean of the age collum is : {df['Age'].mean()}")
print(f"teh median of the age collum is : {df['Age'].median()}")

teh mean of the age collum is : 38.90876288659794
teh median of the age collum is : 37.0

In [33]:
# filling the udpate_df with the mean of the average
print("before filing the values : \n")
print(update_df.isnull().sum())
update_df = df
update_df["Age"] = update_df["Age"].fillna(df["Age"].mean())

print("After updating the na values")
print(update_df.isnull().sum())

before filing the values :

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64
After updating the na values
RowNumber           0
CustomerId          0
Surname             0
CreditScore         0
Geography           0
Gender             54
Age                 0
Tenure              0
Balance             0
NumOfProducts       0
HasCrCard           0
IsActiveMember      0
EstimatedSalary     0
Exited              0
dtype: int64